# Quick Start

This quick start is a complete example to show how to
- create a SQLite database; 
- creat a data table;
- insert data into the table;
- query data from the table.

In [1]:
%load_ext sql

### Create a SQLite Database

For practice purposes, it's advisable to create your own database, so that you are free to perform any operations on it. If using the SQLite shell, we can apply the ***open*** command to both create a SQLite database or open it in case it already exists just like:

> sqlite> .open testdb

Similaryly, we can use ipython-sql to the same thing:

In [3]:
%sql sqlite:///writers.db3

'Connected: @writers.db3'

### Create a table

***%%sql*** let you use multiple SQL statements inside a single cell. 

It is now time to create one using a standard SQL command â€“ CREATE TABLE. If the table already existed in the database, an error will pop up. In addition, we set ***PRIMARY KEY*** on USERID to prevent from inserting duplicate writers into the table.

In [4]:
%%sql
CREATE TABLE writer(
    FirstName VARCHAR(50) NOT NULL,
    LastName VARCHAR(50) NOT NULL,  
    USERID int  NOT NULL UNIQUE, 
    PRIMARY KEY (USERID)
);

 * sqlite:///writers.db3
Done.

[]

### Add data to the table

The table we have just created is empty. Now we insert some sample data inside it. To populate this data in the form of rows, we use the command INSERT.

In [5]:
%%sql
INSERT INTO writer VALUES ('William', 'Shakespeare', 1616);
INSERT INTO writer VALUES ('Lin', 'Han', 1996);
INSERT INTO writer VALUES ('Peter', 'Brecht', 1978);

 * sqlite:///writers.db3
1 rows affected.
1 rows affected.
1 rows affected.

[]

### Write the First Query

Let us now turn our attention to writing a simple query to check the results of our previous operations in which we created a table and inserted three rows of data into it. For this, we would use the command called SELECT.

we can put the query result into a variable such as the following sqlres.

In [6]:
sqlres = %sql SELECT * from writer
sqlres

 * sqlite:///writers.db3
Done.

[('William', 'Shakespeare', 1616),
 ('Lin', 'Han', 1996),
 ('Peter', 'Brecht', 1978)]

You also can select the specific colummns using their names just like:

In [7]:
sqlres = %sql SELECT FirstName, LastName from writer
sqlres

 * sqlite:///writers.db3
Done.

[('William', 'Shakespeare'), ('Lin', 'Han'), ('Peter', 'Brecht')]

In [8]:
%%sql
CREATE TABLE grades(
    studentid int NOT NULL,
    course VARCHAR(50) NOT NULL,  
    grade DOUBLE NOT NULL, 
    credits int NOT NULL
);

 * sqlite:///writers.db3
Done.

[]

In [9]:
sqlres = %sql SELECT * from writer
sqlres

 * sqlite:///writers.db3
Done.

[('William', 'Shakespeare', 1616),
 ('Lin', 'Han', 1996),
 ('Peter', 'Brecht', 1978)]

In [10]:
sqlres = %sql SELECT * from grades
sqlres

 * sqlite:///writers.db3
Done.

[]

In [11]:
%%sql
INSERT INTO grades VALUES (1, 'PY205', 3.8, 3);
INSERT INTO grades VALUES (1, 'PY411', 3.2, 4);
INSERT INTO grades VALUES (1, 'PY412', 3.1, 4);
INSERT INTO grades VALUES (1, 'E101', 3.8, 2);
INSERT INTO grades VALUES (1, 'CS216', 3.5, 3);
INSERT INTO grades VALUES (2, 'PY205', 3.1, 3);
INSERT INTO grades VALUES (2, 'PY411', 2.8, 4);
INSERT INTO grades VALUES (2, 'PY412', 2.4, 4);
INSERT INTO grades VALUES (2, 'E101', 2.9, 2);
INSERT INTO grades VALUES (2, 'CS216', 3.3, 3);

 * sqlite:///writers.db3
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [12]:
sqlres = %sql SELECT * from grades
sqlres

 * sqlite:///writers.db3
Done.

[(1, 'PY205', 3.8, 3),
 (1, 'PY411', 3.2, 4),
 (1, 'PY412', 3.1, 4),
 (1, 'E101', 3.8, 2),
 (1, 'CS216', 3.5, 3),
 (2, 'PY205', 3.1, 3),
 (2, 'PY411', 2.8, 4),
 (2, 'PY412', 2.4, 4),
 (2, 'E101', 2.9, 2),
 (2, 'CS216', 3.3, 3)]

In [13]:
%%sql
CREATE TABLE demographies(
    studentid int NOT NULL,
    gender VARCHAR(50) NOT NULL,  
    credits int NOT NULL
);

 * sqlite:///writers.db3
Done.

[]

In [14]:
%%sql
INSERT INTO demographies VALUES (1, 'm', 22);
INSERT INTO demographies VALUES (2, 'f', 19);
INSERT INTO demographies VALUES (3, 'm', 20);

 * sqlite:///writers.db3
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [15]:
%sql SELECT * from demographies

 * sqlite:///writers.db3
Done.

[(1, 'm', 22), (2, 'f', 19), (3, 'm', 20)]